#include <stdio.h>
#include <string.h>

#include "sub_func.h"

int main() {
    
    /**
     *  第1题. 定义数组，输入表格数据 
    */
    // 学生表
    Student students[] = {
        {"20191000", "李逵", "男"},
        {"20191001", "谢天华", "女"},
        {"20191002", "刘杰", "男"},
        {"20191003", "成兵", "男"},
        {"20191004", "刘月", "女"}
    };
    // 学生选课（成绩）表
    CourseScore scores[] = {
        {"20191000", "1001", 89.0f, 90.0f},
        {"20191001", "1002", 77.0f, 83.0f},
        {"20191002", "1002", 89.0f, 81.0f},
        {"20191003", "1003", 99.0f, 98.0f},
        {"20191004", "1004", 80.0f, 92.0f},
    };
    // 课程表
    Course courses[] = {
        {"1001", "编译原理"},
        {"1002", "计算机基础"},
        {"1003", "数学"},
        {"1004", "英语"}
    };
    
    print_scores(scores, sizeof(students)/sizeof(Student));
    return 0;
}
